Reports/ИсполнениеПланаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИсполнениеПланаПродаж</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ИсполнениеПланаПродаж/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Год = Год(ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)	
	
	Элементы.МенеджерПродаж.Видимость 	= (ВыбранноеЗначение = "МенеджерПродаж");
	Элементы.Технолог.Видимость 		= (ВыбранноеЗначение = "Технолог");
	Элементы.ТочкаПродаж.Видимость 		= (ВыбранноеЗначение = "ТочкаПродаж");
		
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ВидОтчета = "" Тогда 
		ПоказатьПредупреждение(,"Необходимо заполнить поле ""Вид отчета"".");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ТекОбъект = ЭтаФорма.РеквизитФормыВЗначение("Отчет");
	
	ФильтрПоказатель = Неопределено;
	Если ВидОтчета = "МенеджерПродаж" Тогда
		ФильтрПоказатель = Отчет.МенеджерПродаж;
	ИначеЕсли ВидОтчета = "Технолог" Тогда
		ФильтрПоказатель = Отчет.Технолог;
	ИначеЕсли ВидОтчета = "ТочкаПродаж" Тогда
		ФильтрПоказатель = Отчет.ТочкаПродаж;
	КонецЕсли;
	
	Макет = ТекОбъект.ПолучитьМакет("Макет");
	ТабличныйДокумент = МодульОтчетов.СформироватьОтчетИсполнениеПланаПродаж(Макет, Отчет.Год, ФильтрПоказатель, ВидОтчета);
	
КонецПроцедуры
